; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_18)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - person
	)

  (:init
		(= (x b0) -10)
(= (y b0) 0)
(= (x b1) 8)
(= (y b1) 0)
(= (x b2) -6)
(= (y b2) 0)
(= (x b3) 5)
(= (y b3) 0)
(= (x b4) -8)
(= (y b4) 0)
(= (x b5) 7)
(= (y b5) 0)
(= (x b6) 6)
(= (y b6) 0)
(= (x b7) -8)
(= (y b7) 0)
(= (x b8) 10)
(= (y b8) 0)
(= (x b9) -9)
(= (y b9) 0)
(= (x b10) 10)
(= (y b10) 0)
(= (x b11) -9)
(= (y b11) 0)
(= (x b12) -5)
(= (y b12) 0)
(= (x b13) 8)
(= (y b13) 0)

		(= (d p0) 15)
(= (d p1) 99)
(= (d p2) 80)
(= (d p3) 56)
(= (d p4) 73)
(= (d p5) 33)
(= (d p6) 37)
(= (d p7) 71)
(= (d p8) 70)
(= (d p9) 16)
(= (d p10) 10)
(= (d p11) 74)
(= (d p12) 92)
(= (d p13) 1)
(= (d p14) 19)
(= (d p15) 93)
(= (d p16) 62)
(= (d p17) 89)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
(saved p17)
		)
	)
)

; plan
1. (go_north_east b12)
   changed: (x b12) from -5 to -3.5, (y b12) from 0 to 1.5
   goals met: 0 of 18
2. (go_north_east b12)
   changed: (x b12) from -3.5 to -2, (y b12) from 1.5 to 3
   goals met: 0 of 18
3. (go_north_east b12)
   changed: (x b12) from -2 to -0.5, (y b12) from 3 to 4.5
   goals met: 0 of 18
4. (go_north_east b12)
   changed: (x b12) from -0.5 to 1, (y b12) from 4.5 to 6
   goals met: 0 of 18
5. (go_north_east b12)
   changed: (x b12) from 1 to 2.5, (y b12) from 6 to 7.5
   goals met: 0 of 18
6. (go_north_east b12)
   changed: (x b12) from 2.5 to 4, (y b12) from 7.5 to 9
   goals met: 0 of 18
7. (go_north_east b12)
   changed: (x b12) from 4 to 5.5, (y b12) from 9 to 10.5
   goals met: 0 of 18
8. (save_person b12 p13)
   added: (saved p13)
   goals met: 1 of 18
9. (go_north_west b12)
   changed: (x b12) from 5.5 to 4, (y b12) from 10.5 to 12
   goals met: 1 of 18
10. (go_north_west b12)
   changed: (x b12) from 4 to 2.5, (y b12) from 12 to 13.5
   goals met: 1 of 18
11. (save_person b12 p10)
   added: (saved p10)
   goals met: 2 of 18
12. (go_north_west b12)
   changed: (x b12) from 2.5 to 1, (y b12) from 13.5 to 15
   goals met: 2 of 18
13. (go_north_west b12)
   changed: (x b12) from 1 to -0.5, (y b12) from 15 to 16.5
   goals met: 2 of 18
14. (save_person b12 p0)
   added: (saved p0)
   goals met: 3 of 18
15. (save_person b12 p9)
   added: (saved p9)
   goals met: 4 of 18
16. (go_north_east b12)
   changed: (x b12) from -0.5 to 1, (y b12) from 16.5 to 18
   goals met: 4 of 18
17. (go_north_east b12)
   changed: (x b12) from 1 to 2.5, (y b12) from 18 to 19.5
   goals met: 4 of 18
18. (go_north_east b12)
   changed: (x b12) from 2.5 to 4, (y b12) from 19.5 to 21
   goals met: 4 of 18
19. (go_north_east b12)
   changed: (x b12) from 4 to 5.5, (y b12) from 21 to 22.5
   goals met: 4 of 18
20. (go_north_east b12)
   changed: (x b12) from 5.5 to 7, (y b12) from 22.5 to 24
   goals met: 4 of 18
21. (go_north_east b12)
   changed: (x b12) from 7 to 8.5, (y b12) from 24 to 25.5
   goals met: 4 of 18
22. (go_north_east b12)
   changed: (x b12) from 8.5 to 10, (y b12) from 25.5 to 27
   goals met: 4 of 18
23. (go_north_east b12)
   changed: (x b12) from 10 to 11.5, (y b12) from 27 to 28.5
   goals met: 4 of 18
24. (go_north_east b12)
   changed: (x b12) from 11.5 to 13, (y b12) from 28.5 to 30
   goals met: 4 of 18
25. (go_north_east b12)
   changed: (x b12) from 13 to 14.5, (y b12) from 30 to 31.5
   goals met: 4 of 18
26. (go_north_east b12)
   changed: (x b12) from 14.5 to 16, (y b12) from 31.5 to 33
   goals met: 4 of 18
27. (go_north_east b12)
   changed: (x b12) from 16 to 17.5, (y b12) from 33 to 34.5
   goals met: 4 of 18
28. (go_north_east b12)
   changed: (x b12) from 17.5 to 19, (y b12) from 34.5 to 36
   goals met: 4 of 18
29. (go_north_east b12)
   changed: (x b12) from 19 to 20.5, (y b12) from 36 to 37.5
   goals met: 4 of 18
30. (go_west b12)
   changed: (x b12) from 20.5 to 17.5
   goals met: 4 of 18
31. (go_west b12)
   changed: (x b12) from 17.5 to 14.5
   goals met: 4 of 18
32. (go_west b12)
   changed: (x b12) from 14.5 to 11.5
   goals met: 4 of 18
33. (go_west b12)
   changed: (x b12) from 11.5 to 8.5
   goals met: 4 of 18
34. (go_west b12)
   changed: (x b12) from 8.5 to 5.5
   goals met: 4 of 18
35. (go_west b12)
   changed: (x b12) from 5.5 to 2.5
   goals met: 4 of 18
36. (go_north_east b12)
   changed: (x b12) from 2.5 to 4, (y b12) from 37.5 to 39
   goals met: 4 of 18
37. (go_north_east b12)
   changed: (x b12) from 4 to 5.5, (y b12) from 39 to 40.5
   goals met: 4 of 18
38. (go_north_east b12)
   changed: (x b12) from 5.5 to 7, (y b12) from 40.5 to 42
   goals met: 4 of 18
39. (go_north_east b12)
   changed: (x b12) from 7 to 8.5, (y b12) from 42 to 43.5
   goals met: 4 of 18
40. (go_north_east b12)
   changed: (x b12) from 8.5 to 10, (y b12) from 43.5 to 45
   goals met: 4 of 18
41. (go_north_east b12)
   changed: (x b12) from 10 to 11.5, (y b12) from 45 to 46.5
   goals met: 4 of 18
42. (save_person b12 p5)
   added: (saved p5)
   goals met: 5 of 18
43. (go_west b12)
   changed: (x b12) from 11.5 to 8.5
   goals met: 5 of 18
44. (save_person b12 p6)
   added: (saved p6)
   goals met: 6 of 18
45. (go_west b12)
   changed: (x b12) from 8.5 to 5.5
   goals met: 6 of 18
46. (go_north_west b12)
   changed: (x b12) from 5.5 to 4, (y b12) from 46.5 to 48
   goals met: 6 of 18
47. (go_north_east b12)
   changed: (x b12) from 4 to 5.5, (y b12) from 48 to 49.5
   goals met: 6 of 18
48. (go_north_east b12)
   changed: (x b12) from 5.5 to 7, (y b12) from 49.5 to 51
   goals met: 6 of 18
49. (go_north_east b12)
   changed: (x b12) from 7 to 8.5, (y b12) from 51 to 52.5
   goals met: 6 of 18
50. (go_north_east b12)
   changed: (x b12) from 8.5 to 10, (y b12) from 52.5 to 54
   goals met: 6 of 18
51. (go_north_east b12)
   changed: (x b12) from 10 to 11.5, (y b12) from 54 to 55.5
   goals met: 6 of 18
52. (go_south_east b12)
   changed: (x b12) from 11.5 to 9.5, (y b12) from 55.5 to 53.5
   goals met: 6 of 18
53. (go_north_east b12)
   changed: (x b12) from 9.5 to 11, (y b12) from 53.5 to 55
   goals met: 6 of 18
54. (go_north_east b12)
   changed: (x b12) from 11 to 12.5, (y b12) from 55 to 56.5
   goals met: 6 of 18
55. (go_north_east b12)
   changed: (x b12) from 12.5 to 14, (y b12) from 56.5 to 58
   goals met: 6 of 18
56. (go_west b12)
   changed: (x b12) from 14 to 11
   goals met: 6 of 18
57. (go_west b12)
   changed: (x b12) from 11 to 8
   goals met: 6 of 18
58. (go_west b12)
   changed: (x b12) from 8 to 5
   goals met: 6 of 18
59. (go_west b12)
   changed: (x b12) from 5 to 2
   goals met: 6 of 18
60. (save_person b12 p3)
   added: (saved p3)
   goals met: 7 of 18
61. (go_north_east b12)
   changed: (x b12) from 2 to 3.5, (y b12) from 58 to 59.5
   goals met: 7 of 18
62. (go_north_east b12)
   changed: (x b12) from 3.5 to 5, (y b12) from 59.5 to 61
   goals met: 7 of 18
63. (go_north_east b12)
   changed: (x b12) from 5 to 6.5, (y b12) from 61 to 62.5
   goals met: 7 of 18
64. (go_north_east b12)
   changed: (x b12) from 6.5 to 8, (y b12) from 62.5 to 64
   goals met: 7 of 18
65. (go_north_east b12)
   changed: (x b12) from 8 to 9.5, (y b12) from 64 to 65.5
   goals met: 7 of 18
66. (go_north_west b12)
   changed: (x b12) from 9.5 to 8, (y b12) from 65.5 to 67
   goals met: 7 of 18
67. (go_north_east b12)
   changed: (x b12) from 8 to 9.5, (y b12) from 67 to 68.5
   goals met: 7 of 18
68. (go_north_east b12)
   changed: (x b12) from 9.5 to 11, (y b12) from 68.5 to 70
   goals met: 7 of 18
69. (go_north_east b3)
   changed: (x b3) from 5 to 6.5, (y b3) from 0 to 1.5
   goals met: 7 of 18
70. (go_north_east b3)
   changed: (x b3) from 6.5 to 8, (y b3) from 1.5 to 3
   goals met: 7 of 18
71. (go_north_east b3)
   changed: (x b3) from 8 to 9.5, (y b3) from 3 to 4.5
   goals met: 7 of 18
72. (go_north_east b3)
   changed: (x b3) from 9.5 to 11, (y b3) from 4.5 to 6
   goals met: 7 of 18
73. (go_north_east b3)
   changed: (x b3) from 11 to 12.5, (y b3) from 6 to 7.5
   goals met: 7 of 18
74. (go_north_east b12)
   changed: (x b12) from 11 to 12.5, (y b12) from 70 to 71.5
   goals met: 7 of 18
75. (go_north_east b12)
   changed: (x b12) from 12.5 to 14, (y b12) from 71.5 to 73
   goals met: 7 of 18
76. (go_north_east b12)
   changed: (x b12) from 14 to 15.5, (y b12) from 73 to 74.5
   goals met: 7 of 18
77. (go_west b12)
   changed: (x b12) from 15.5 to 12.5
   goals met: 7 of 18
78. (save_person b12 p16)
   added: (saved p16)
   goals met: 8 of 18
79. (go_north_east b12)
   changed: (x b12) from 12.5 to 14, (y b12) from 74.5 to 76
   goals met: 8 of 18
80. (go_north_east b12)
   changed: (x b12) from 14 to 15.5, (y b12) from 76 to 77.5
   goals met: 8 of 18
81. (go_north_west b12)
   changed: (x b12) from 15.5 to 14, (y b12) from 77.5 to 79
   goals met: 8 of 18
82. (go_north_west b12)
   changed: (x b12) from 14 to 12.5, (y b12) from 79 to 80.5
   goals met: 8 of 18
83. (go_north_west b12)
   changed: (x b12) from 12.5 to 11, (y b12) from 80.5 to 82
   goals met: 8 of 18
84. (save_person b12 p7)
   added: (saved p7)
   goals met: 9 of 18
85. (save_person b12 p8)
   added: (saved p8)
   goals met: 10 of 18
86. (go_north_east b12)
   changed: (x b12) from 11 to 12.5, (y b12) from 82 to 83.5
   goals met: 10 of 18
87. (go_north_west b12)
   changed: (x b12) from 12.5 to 11, (y b12) from 83.5 to 85
   goals met: 10 of 18
88. (save_person b12 p4)
   added: (saved p4)
   goals met: 11 of 18
89. (save_person b12 p11)
   added: (saved p11)
   goals met: 12 of 18
90. (go_north_east b12)
   changed: (x b12) from 11 to 12.5, (y b12) from 85 to 86.5
   goals met: 12 of 18
91. (go_north_west b12)
   changed: (x b12) from 12.5 to 11, (y b12) from 86.5 to 88
   goals met: 12 of 18
92. (go_north_west b12)
   changed: (x b12) from 11 to 9.5, (y b12) from 88 to 89.5
   goals met: 12 of 18
93. (save_person b12 p2)
   added: (saved p2)
   goals met: 13 of 18
94. (go_north_west b12)
   changed: (x b12) from 9.5 to 8, (y b12) from 89.5 to 91
   goals met: 13 of 18
95. (go_north_west b12)
   changed: (x b12) from 8 to 6.5, (y b12) from 91 to 92.5
   goals met: 13 of 18
96. (go_north_west b12)
   changed: (x b12) from 6.5 to 5, (y b12) from 92.5 to 94
   goals met: 13 of 18
97. (save_person b12 p17)
   added: (saved p17)
   goals met: 14 of 18
98. (go_north_west b12)
   changed: (x b12) from 5 to 3.5, (y b12) from 94 to 95.5
   goals met: 14 of 18
99. (save_person b12 p12)
   added: (saved p12)
   goals met: 15 of 18
100. (go_north_west b12)
   changed: (x b12) from 3.5 to 2, (y b12) from 95.5 to 97
   goals met: 15 of 18
101. (save_person b12 p15)
   added: (saved p15)
   goals met: 16 of 18
102. (go_north_west b12)
   changed: (x b12) from 2 to 0.5, (y b12) from 97 to 98.5
   goals met: 16 of 18
103. (go_north_west b12)
   changed: (x b12) from 0.5 to -1, (y b12) from 98.5 to 100
   goals met: 16 of 18
104. (save_person b12 p1)
   added: (saved p1)
   goals met: 17 of 18
105. (go_north_west b3)
   changed: (x b3) from 12.5 to 11, (y b3) from 7.5 to 9
   goals met: 17 of 18
106. (go_north_west b3)
   changed: (x b3) from 11 to 9.5, (y b3) from 9 to 10.5
   goals met: 17 of 18
107. (go_north_west b3)
   changed: (x b3) from 9.5 to 8, (y b3) from 10.5 to 12
   goals met: 17 of 18
108. (go_north_west b3)
   changed: (x b3) from 8 to 6.5, (y b3) from 12 to 13.5
   goals met: 17 of 18
109. (go_north_west b3)
   changed: (x b3) from 6.5 to 5, (y b3) from 13.5 to 15
   goals met: 17 of 18
110. (go_north_west b3)
   changed: (x b3) from 5 to 3.5, (y b3) from 15 to 16.5
   goals met: 17 of 18
111. (go_north_west b3)
   changed: (x b3) from 3.5 to 2, (y b3) from 16.5 to 18
   goals met: 17 of 18
112. (go_north_west b3)
   changed: (x b3) from 2 to 0.5, (y b3) from 18 to 19.5
   goals met: 17 of 18
113. (save_person b3 p14)
   added: (saved p14)
   goals met: 18 of 18
